roam/public_html/20260128165339-starlink_security_posture.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-02-15 Sun 17:34 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Starlink Security Posture</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/custom.css" />
</head>
<body>
<div id="preamble" class="status">
<nav><a href"/"><- home</a></nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Starlink Security Posture</h1>
</header><p>
2022 - BlackHat presentation by Wouters demonstrates hardware vulnerability in Starlink through modchip.
Glitching attack, small EMP/voltage spike to skip instructions.
</p>

<p>
[ SoC Root of Trust ]
</p>
<hr>

<hr>
<p>
[ BSEC peripheral (eFuses) ]
Root of Trust public key
security state
rma (Return Merchandise Authorization) state (Open/Dev -&gt; Prod -&gt; RMA/servicing -&gt; Bricked)
rollback counters (incremental counters to prevent device rollback)
Luks keys (Disk Encryption)
</p>
<hr>

<hr>
<p>
[ ROM Bootloader ]
immutable
loads and verifies BL2
Uses internal SRAM
</p>
<hr>

<hr>

<p>
^
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">[ ST Mini Certificate ]</td>
</tr>

<tr>
<td class="org-left">Rollback Counters</td>
</tr>

<tr>
<td class="org-left">ED25519 sig with SHA512 of signed data</td>
</tr>
</tbody>
</table>

<hr>
<p>
[ eMMC ]
BL2 (Trusted boot firmware)
BL31 (Secure world runtime firmware)
BL33 (U-Boot)
Flattened uImage Tree (FIT)
SpaceX Runtime (dm-verity)
Calibration/EDR/&#x2026;(dm-verity/LUKS)
</p>
<hr>

<ol class="org-ol">
<li>BL1 loads BL2 certificate from eMMC</li>
<li>BL1 verifies certificate sig</li>
<li>BL1 loads the BL2 firmware from eMMC</li>
<li>BL1 verifies that SHA512(BL2) matches the hash contained in the certificate</li>
</ol>

<p>
ROM bootloader mapped at 0x30000000 and readable from BL2
BSEC eFuses mapped at 0x22400000 (shadow registers)
</p>

<p>
All interesting comms over mutually authed TLS (STSAFE)
</p>

<p>
Quad Cortex-A53
</p>
</div>
</body>
</html>
